{
  "backend/main.mo": "Defines order-related types and an actor providing CRUD operations for orders, payment confirmations, and status updates with timeline events.",
  "backend/migration.mo": "Provides a migration function that upgrades stored orders by adding status and statusEvents while keeping existing fields intact.",
  "feature_evidence.json": "Contains feature evidence metadata mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists concise summaries of various frontend files, describing their purpose and behavior.",
  "frontend/android/.gitkeep": "Empty marker file preserving the Android platform directory for future Capacitor builds.",
  "frontend/capacitor.config.ts": "Capacitor configuration specifying app metadata, web directory, and Android build settings.",
  "frontend/index.css": "Global Tailwind-based styling with theme variables and light/dark mode rules.",
  "frontend/index.html": "Root HTML document setting up PWA metadata, icons, and mounting the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, theme, icons, and display settings.",
  "frontend/README-android-apk.md": "Documentation explaining how to build the Android APK using Capacitor and required tooling.",
  "frontend/src/App.tsx": "Main React component controlling navigation, admin access, ordering flow, WhatsApp integration, and APK download handling.",
  "frontend/src/components/admin/AdminApkDownloadButton.tsx": "Checks availability of the admin APK and downloads it or shows an unavailable warning.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin interface for viewing, filtering, and managing orders with detail views and quick stats.",
  "frontend/src/components/admin/OrderDetailView.tsx": "Displays detailed order info in a sheet and allows admins to update order status.",
  "frontend/src/components/admin/OrdersFilters.tsx": "Provides payment and status filter controls for the admin orders list.",
  "frontend/src/components/admin/OrdersTable.tsx": "Renders the admin orders table with status, payment info, and a view-details action.",
  "frontend/src/components/OrderForm.tsx": "UI for selecting plate type and quantity, validating minimum order rules, and creating an order.",
  "frontend/src/components/OwnerPhoto.tsx": "Renders the owner’s photo with size options and a fallback image on load error.",
  "frontend/src/components/PostOrderConfirmationModal.tsx": "Displays payment instructions, UPI actions, WhatsApp links, and a payment confirmation form after an order is placed.",
  "frontend/src/components/PromoPopup.tsx": "Timed promotional popup encouraging users to order, with session-based dismissal.",
  "frontend/src/components/SimpleModal.tsx": "Generic modal showing text content with optional WhatsApp link copying and dismissal.",
  "frontend/src/config/apk.ts": "Defines APK download configs for customer and admin apps.",
  "frontend/src/config/payment.ts": "Stores business payment settings such as UPI VPA, delivery charge, and name.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity.",
  "frontend/src/hooks/useAdminOrders.ts": "Fetches all orders for the admin dashboard when authorized.",
  "frontend/src/hooks/useCreateOrder.ts": "Mutation hook to create new orders and invalidate order caches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication.",
  "frontend/src/hooks/useUpdateOrderStatus.ts": "Mutation hook to update order status and refresh admin order data.",
  "frontend/src/hooks/useUpdatePaymentConfirmation.ts": "Mutation hook to submit payment confirmation details and refresh orders.",
  "frontend/src/index.css": "Tailwind base styles with custom theme variables and animations.",
  "frontend/src/lib/adminAccess.ts": "Utilities to read an admin token from the URL hash and verify authorization.",
  "frontend/src/lib/apkAvailability.ts": "Helpers to check APK availability, download APKs, and retrieve unavailable messages for customer and admin builds.",
  "frontend/src/lib/orderRules.ts": "Defines minimum plate rules for delivery and provides related validation and error messages.",
  "frontend/src/lib/upi.ts": "Builds UPI deep links, opens various UPI apps, and supports copying payment links to clipboard.",
  "frontend/src/lib/vpaValidation.ts": "Validates UPI VPAs against format and placeholder patterns and returns a generic error message.",
  "frontend/src/lib/whatsapp.ts": "Generates WhatsApp deep links for order messages, payment confirmations, and screenshot requests, and provides open helpers.",
  "frontend/src/main.tsx": "App bootstrap that sets up React, React Query, and the InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended colors, animations, typography, and container-query plugins.",
  "project_state.json": "Project metadata describing app goals, admin panel features, and existing requirements."
}