{
  "backend/main.mo": "Defines PlateType and Order types, stores orders in a Map, and exposes createOrder plus read queries for single and all orders.",
  "feature_evidence.json": "Lists feature evidence records linking feature IDs to frontend files and components used for Paytm QR and bill breakdown in the confirmation modal.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing each frontend file's purpose, including modals, order form, styles, and WhatsApp utilities.",
  "frontend/index.css": "Tailwind base/config styles defining color variables for light/dark themes and applying global background and text settings.",
  "frontend/index.html": "Basic HTML shell loading the React app via root div and main.tsx script.",
  "frontend/src/App.tsx": "Main React app with navigation, promo popup, modals, order form, and WhatsApp auto-open or fallback handling after order creation.",
  "frontend/src/components/OrderForm.tsx": "Plate selection and quantity form that validates minimum order and calls backend createOrder, returning the created order on success.",
  "frontend/src/components/PostOrderConfirmationModal.tsx": "Displays order success details, bill summary, Paytm QR code, and optional WhatsApp fallback link with copy support.",
  "frontend/src/components/PromoPopup.tsx": "Session-based promotional popup showing a momo offer with an Order Now action that scrolls to the order section.",
  "frontend/src/components/SimpleModal.tsx": "A modal component that displays a message, optional WhatsApp link actions, and prevents body scroll while open.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating related queries when the actor changes.",
  "frontend/src/hooks/useCreateOrder.ts": "React Query mutation hook that calls the backend to create an order and invalidates order-related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login/logout handling, and identity persistence via AuthClient.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables defining the app’s color palette, animations, and layout defaults.",
  "frontend/src/lib/orderRules.ts": "Defines minimum plate rules for delivery and provides helper functions for validation and messaging.",
  "frontend/src/lib/whatsapp.ts": "Builds a WhatsApp deep link with prefilled order details and provides a helper to open it in a new window.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and Internet Identity providers and renders the root component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, typography, container queries, and utilities.",
  "project_state.json": "Stores project requirements, architectural notes, known issues, and state metadata for development tracking."
}