{
  "backend/main.mo": "Motoko backend defining order, payment, and build-status types with CRUD operations for orders and status updates.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file providing short functional summaries for numerous frontend source files and utilities.",
  "frontend/android/.gitkeep": "Placeholder file to preserve the empty Android platform directory.",
  "frontend/capacitor.config.ts": "Capacitor configuration specifying app metadata, web directory, and Android build options.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color variables, dark mode tokens, and base styles.",
  "frontend/index.html": "Main HTML entry with meta tags, favicon, PWA manifest, and root mount point for the React app.",
  "frontend/public/ads.txt": "Ads.txt configuration listing authorized advertising account for Google AdSense.",
  "frontend/public/downloads/.gitkeep": "Placeholder to keep the downloads directory in version control.",
  "frontend/public/downloads/README.md": "Instructions for managing and building downloadable APKs stored in the downloads directory.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and startup settings.",
  "frontend/README-android-apk.md": "Documentation explaining how to build the Android APK using Capacitor and required tooling.",
  "frontend/scripts/predeploy-verify.sh": "Script running pre-deployment verification via the main verify-build script.",
  "frontend/scripts/retry-build-deploy.sh": "Automated build-and-deploy script with logging and step-by-step execution helpers.",
  "frontend/scripts/verify-build.sh": "Comprehensive build verification script performing static checks, dependency install, type check, lint, and build.",
  "frontend/scripts/verify-static-assets.sh": "Checks for required generated static asset files and exits with an error listing any missing ones before build/deploy.",
  "frontend/src/App.tsx": "Main React app managing navigation, ordering flow, APK download checks, admin login, and conditional admin dashboard rendering.",
  "frontend/src/components/admin/AdminApkDownloadButton.tsx": "Admin-only button that checks for admin APK availability and initiates download or shows an unavailable message.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard that loads orders, applies filters, shows stats, and renders sections like owner settings, build status, and orders table.",
  "frontend/src/components/admin/AdminLoginModal.tsx": "PIN-based admin login modal that validates a 4-digit PIN and stores the admin token.",
  "frontend/src/components/admin/BuildDeployStatusPanel.tsx": "Displays the latest frontend build, installation, and deploy status with logs and success indicators.",
  "frontend/src/components/admin/OrderDetailView.tsx": "Side panel showing full order details with status update controls and formatted timestamps.",
  "frontend/src/components/admin/OrdersFilters.tsx": "Filter controls for admin orders, allowing filtering by payment and order status.",
  "frontend/src/components/admin/OrdersTable.tsx": "Table listing orders with key details, badges, timestamps, and a view action to open order details.",
  "frontend/src/components/admin/OwnerSettingsSection.tsx": "Owner-only settings section exposing advanced business settings like ad configuration.",
  "frontend/src/components/ads/AdsHeadInjector.tsx": "Injects the provider’s head script at runtime when ads are enabled and configured.",
  "frontend/src/components/ads/AdSlot.tsx": "Renders a configured ad slot by mounting ad snippets if ads are enabled and the slot is defined.",
  "frontend/src/components/ads/AdsSettingsPanel.tsx": "Provides a dialog UI for configuring AdSense settings, validating input, and saving to localStorage.",
  "frontend/src/components/HashtagsBlock.tsx": "Displays a styled list of hashtags loaded from configuration.",
  "frontend/src/components/OrderForm.tsx": "Renders plate selection and quantity input, validates minimum order rules, and creates orders via a custom hook.",
  "frontend/src/components/OwnerPhoto.tsx": "Shows a founder photo with size options and falls back to a placeholder image on load error.",
  "frontend/src/components/PostOrderConfirmationModal.tsx": "Modal for payment confirmation with UPI options, WhatsApp fallback links, and UTR submission handling.",
  "frontend/src/components/PromoPopup.tsx": "Timed promotional popup encouraging ordering, dismissible and stored per session.",
  "frontend/src/components/SimpleModal.tsx": "Generic modal displaying a message with optional WhatsApp link and copy-to-clipboard support.",
  "frontend/src/config/ads.ts": "Defines ads configuration and helpers to generate AdSense head and slot scripts.",
  "frontend/src/config/apk.ts": "Provides APK metadata for customer and admin apps including URLs, versions, and labels.",
  "frontend/src/config/contact.ts": "Exports centralized contact phone and location values.",
  "frontend/src/config/footer.ts": "Defines footer tagline, copyright text, and quick‑link metadata.",
  "frontend/src/config/hashtags.ts": "Provides a constant list of hashtags used across the application.",
  "frontend/src/config/ownerPhotos.ts": "Exports URLs for founder images in multiple sizes plus defaults.",
  "frontend/src/config/payment.ts": "Contains business UPI ID, delivery charge, and payment‑related constants.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAdminAuthorization.ts": "Tracks admin authorization based on URL hash and token presence with reactive updates.",
  "frontend/src/hooks/useAdminOrders.ts": "Fetches all orders for admin view when authorization and actor availability are valid.",
  "frontend/src/hooks/useAdsConfig.ts": "Combines stored settings, environment checks, and snippet generation to produce runtime ads config.",
  "frontend/src/hooks/useCreateOrder.ts": "Provides a mutation to create orders via the backend actor and invalidates order queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, loading, and stored identity through a React context provider.",
  "frontend/src/hooks/useLastBuildStatus.ts": "Fetches the backend’s last build/deploy status for admin monitoring with periodic refresh.",
  "frontend/src/hooks/useUpdateOrderStatus.ts": "Provides a mutation to update order status and refreshes admin order data on success.",
  "frontend/src/hooks/useUpdatePaymentConfirmation.ts": "Custom React Query mutation hook calling backend to update an order's payment confirmation and refreshing the orders query.",
  "frontend/src/index.css": "Tailwind base config defining color variables, dark mode theme, and basic animation utilities.",
  "frontend/src/lib/adminAccess.ts": "Utility functions for reading, validating, setting, and clearing an admin PIN token stored in the URL hash.",
  "frontend/src/lib/ads.ts": "Utilities for safely injecting ad provider scripts and mounting or unmounting ad slot snippets in the DOM.",
  "frontend/src/lib/adsenseSnippet.ts": "Parses AdSense script snippets to extract and validate a ca-pub client ID.",
  "frontend/src/lib/adsOwnerSettings.ts": "Manages AdSense owner settings in localStorage with validation, change events, and helper utilities.",
  "frontend/src/lib/apkAvailability.ts": "Checks APK availability, retrieves APK size, triggers downloads, and provides messages for customer and admin APKs.",
  "frontend/src/lib/orderRules.ts": "Defines minimum delivery rules and provides helper functions for validating order quantities and generating messages.",
  "frontend/src/lib/runtimeEnvironment.ts": "Detects whether the app runs in a Capacitor native wrapper or a standard web environment.",
  "frontend/src/lib/upi.ts": "Builds UPI payment links, opens payment apps like Paytm or Google Pay, and supports copying UPI links.",
  "frontend/src/lib/vpaValidation.ts": "Validates UPI VPAs against format rules and placeholder patterns and provides a generic error message.",
  "frontend/src/lib/whatsapp.ts": "Provides helpers to build WhatsApp message links for orders, payments, and screenshot confirmations, plus functions to open those links in a new tab.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related files, enabling strict mode and ESNext modules.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variable injection, path aliases, dev server proxying, and build options.",
  "project_state.json": "Tracks project metadata, implemented features, pending requests, and architectural notes."
}