{
  "backend/main.mo": "Motoko canister managing orders with CRUD operations, payment confirmation updates, and status timeline tracking.",
  "feature_evidence.json": "Feature evidence report describing an image‑update requirement for the Dilkhush founder photo and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including components, hooks, utilities, and configs.",
  "frontend/android/.gitkeep": "Placeholder file to keep the Android platform directory under version control.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app ID, name, web directory, HTTPS scheme, and Android build settings.",
  "frontend/index.css": "Tailwind CSS setup with OKLCH color variables, theming, and global base styles.",
  "frontend/index.html": "Main HTML entry including meta tags, PWA manifest, icons, and script bootstrap for the React app.",
  "frontend/public/ads.txt": "Ads.txt file authorizing a specific Google AdSense publisher account.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining name, colors, icons, and app display settings.",
  "frontend/README-android-apk.md": "Instructions for building the Android APK using Capacitor and Android Studio.",
  "frontend/src/App.tsx": "Main React app handling navigation, orders, WhatsApp flow, admin mode, ads injection, and founder photo rendering.",
  "frontend/src/components/admin/AdminApkDownloadButton.tsx": "Admin APK download button that checks file availability before triggering download and shows an unavailable alert.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard showing order stats, filters, table view, order detail access, and logout plus APK download.",
  "frontend/src/components/admin/AdminLoginModal.tsx": "PIN-based admin login modal validating a 4‑digit PIN before granting dashboard access.",
  "frontend/src/components/admin/OrderDetailView.tsx": "Order detail side panel with formatted info and controls to update order status via mutation.",
  "frontend/src/components/admin/OrdersFilters.tsx": "Provides admin UI controls for filtering orders by payment status and order status.",
  "frontend/src/components/admin/OrdersTable.tsx": "Displays a table of orders with formatted fields, status badges, and a view-details action.",
  "frontend/src/components/ads/AdsHeadInjector.tsx": "Injects the ad provider’s head script at runtime when ads are enabled.",
  "frontend/src/components/ads/AdSlot.tsx": "Renders a configured ad slot by mounting provider snippets when ads are enabled.",
  "frontend/src/components/ads/AdsSettingsPanel.tsx": "UI panel for owners to configure AdSense settings, validate snippets, and save them locally.",
  "frontend/src/components/OrderForm.tsx": "Plate selection and quantity form that validates minimum order and submits createOrder to backend.",
  "frontend/src/components/OwnerPhoto.tsx": "Reusable owner photo component with fallback image handling, size variants, and default Dilkhush founder image.",
  "frontend/src/components/PostOrderConfirmationModal.tsx": "Modal for post‑order payment steps including UPI app launches, WhatsApp fallback links, and payment confirmation form handling.",
  "frontend/src/components/PromoPopup.tsx": "Timed promotional popup showing a momo offer with session-based dismissal and an order callback.",
  "frontend/src/components/SimpleModal.tsx": "Generic modal displaying text content with optional WhatsApp link opening and copy-to-clipboard support.",
  "frontend/src/config/ads.ts": "Defines ad config structures and helpers to generate AdSense head scripts and slot snippets.",
  "frontend/src/config/apk.ts": "Provides APK metadata and download URLs for customer and admin apps.",
  "frontend/src/config/ownerPhotos.ts": "Exports paths to founder images for use throughout the app.",
  "frontend/src/config/payment.ts": "Stores centralized business payment settings including UPI ID, delivery charge, and business name.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries.",
  "frontend/src/hooks/useAdminAuthorization.ts": "Tracks admin authorization state reactively based on URL hash and navigation events.",
  "frontend/src/hooks/useAdminOrders.ts": "Fetches all admin orders when authorized, refreshing periodically.",
  "frontend/src/hooks/useAdsConfig.ts": "Combines stored settings and environment checks to produce the effective runtime ads configuration.",
  "frontend/src/hooks/useCreateOrder.ts": "Provides a mutation hook to create orders via the backend actor and invalidate related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth using Dfinity AuthClient, handling login, stored identity loading, and status flags.",
  "frontend/src/hooks/useUpdateOrderStatus.ts": "Defines a react-query mutation to update an order's status through the backend actor and refresh the admin orders cache.",
  "frontend/src/hooks/useUpdatePaymentConfirmation.ts": "Implements a mutation for submitting payment confirmation details and invalidates the orders query on success.",
  "frontend/src/index.css": "Tailwind base stylesheet defining light/dark theme CSS variables and utility animations for fade and zoom effects.",
  "frontend/src/lib/adminAccess.ts": "Implements admin access helpers using a PIN stored in the URL hash, with functions to read, validate, set, and clear the token.",
  "frontend/src/lib/ads.ts": "Utility for injecting third‑party ad provider scripts once and mounting/unmounting ad slot snippets safely in the DOM.",
  "frontend/src/lib/adsenseSnippet.ts": "Parses AdSense snippets to extract and validate a ca-pub client ID from various input formats.",
  "frontend/src/lib/adsOwnerSettings.ts": "Manages localStorage persistence, validation, and change notifications for AdSense owner settings.",
  "frontend/src/lib/apkAvailability.ts": "Checks availability and triggers download of customer/admin APKs using HEAD requests and dynamic link creation.",
  "frontend/src/lib/orderRules.ts": "Defines minimum order rules for delivery and helper functions for related validation messages.",
  "frontend/src/lib/runtimeEnvironment.ts": "Detects whether the app is running in a Capacitor environment or a standard web browser.",
  "frontend/src/lib/upi.ts": "Utilities for building UPI deep links, opening specific UPI apps (Paytm, Google Pay, generic), and copying payment links.",
  "frontend/src/lib/vpaValidation.ts": "Validates UPI VPAs against format and placeholder patterns and provides an error message for invalid VPAs.",
  "frontend/src/lib/whatsapp.ts": "Generates WhatsApp deep links for order messages, payment confirmations, and screenshot requests, and opens them in new windows.",
  "frontend/src/main.tsx": "Sets up the React app root with React Query and Internet Identity providers before rendering App.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugin usage.",
  "project_state.json": "Metadata describing project state, image replacement requirements, and pending feature requests."
}