{
  "backend/main.mo": "Motoko canister managing orders with creation, status updates, payment confirmation, and timeline tracking.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of various frontend components, hooks, configs, and utilities.",
  "frontend/android/.gitkeep": "Placeholder file preserving the Android platform directory in version control.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app ID, name, web directory, and Android build settings.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, dark mode variables, and base styling.",
  "frontend/index.html": "Main HTML entry for the React app with meta tags, PWA manifest, and script loader.",
  "frontend/public/ads.txt": "Ads.txt declaration listing the authorized Google AdSense publisher account.",
  "frontend/public/downloads/.gitkeep": "Placeholder ensuring the downloads directory is tracked in Git.",
  "frontend/public/downloads/README.md": "Documentation for managing and building downloadable customer and admin APK files.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theming, and application icons.",
  "frontend/README-android-apk.md": "Guide explaining how to build the Android APK for the React app using Capacitor.",
  "frontend/scripts/verify-build.sh": "Shell script automating frontend build verification, type checking, linting, and build execution.",
  "frontend/src/App.tsx": "Main app component handling routing between user interface and admin dashboard, APK download logic, order flow, and global modals.",
  "frontend/src/components/admin/AdminApkDownloadButton.tsx": "Admin-only APK download button that checks availability and shows error messaging.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin dashboard showing orders, filters, statistics, settings, and admin APK download.",
  "frontend/src/components/admin/AdminLoginModal.tsx": "Modal for entering and validating a 4‑digit admin PIN, storing token and handling errors.",
  "frontend/src/components/admin/OrderDetailView.tsx": "Side sheet showing full order details with status selection and async status updates.",
  "frontend/src/components/admin/OrdersFilters.tsx": "UI filters for admin orders list, allowing selection of payment and order status.",
  "frontend/src/components/admin/OrdersTable.tsx": "Admin table listing orders with formatted fields, status badges, and a view‑details action.",
  "frontend/src/components/admin/OwnerSettingsSection.tsx": "Owner‑level settings section exposing AdSense configuration via AdsSettingsPanel.",
  "frontend/src/components/ads/AdsHeadInjector.tsx": "Injects the ad provider’s head script at runtime when ads are enabled.",
  "frontend/src/components/ads/AdSlot.tsx": "Renders an ad slot by mounting configured snippets when ads are enabled.",
  "frontend/src/components/ads/AdsSettingsPanel.tsx": "Dialog for configuring AdSense settings, validating input, extracting client ID, and saving to localStorage.",
  "frontend/src/components/OrderForm.tsx": "Order form allowing selection of plate type and quantity, validating minimum order rules, and submitting orders.",
  "frontend/src/components/OwnerPhoto.tsx": "Displays founder photo with fallback handling and size options.",
  "frontend/src/components/PostOrderConfirmationModal.tsx": "Modal shown after an order to handle payment steps, UPI interactions, WhatsApp links, and confirmation submission.",
  "frontend/src/components/PromoPopup.tsx": "Timed promotional popup prompting users to order, dismissible and tracked via session storage.",
  "frontend/src/components/SimpleModal.tsx": "Generic modal for showing messages with optional WhatsApp link copying.",
  "frontend/src/config/ads.ts": "Defines ads config structure and helpers to generate AdSense head and slot snippets.",
  "frontend/src/config/apk.ts": "Static configuration for customer and admin APK download metadata.",
  "frontend/src/config/ownerPhotos.ts": "Centralized URLs for founder images in multiple resolutions.",
  "frontend/src/config/payment.ts": "Defines business UPI ID, delivery charge, and business name for payment handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuthorization.ts": "Tracks admin authorization state by reacting to URL hash changes and token presence.",
  "frontend/src/hooks/useAdminOrders.ts": "Fetches all orders for admin view when authorized, refreshing periodically.",
  "frontend/src/hooks/useAdsConfig.ts": "Builds runtime ads configuration based on user settings, environment, and admin mode.",
  "frontend/src/hooks/useCreateOrder.ts": "Provides a mutation to create orders via the backend actor and invalidates order queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth client, login state, and exposes identity context to components.",
  "frontend/src/hooks/useUpdateOrderStatus.ts": "Mutation hook to update an order’s status and refresh admin order data.",
  "frontend/src/hooks/useUpdatePaymentConfirmation.ts": "Updates payment confirmation data for an order and invalidates order queries.",
  "frontend/src/index.css": "Tailwind base styling with a warm color palette and utility animations for the UI.",
  "frontend/src/lib/adminAccess.ts": "Parses, validates, sets, and clears admin PIN tokens stored in the URL hash.",
  "frontend/src/lib/ads.ts": "Safely injects ad provider scripts and mounts or unmounts ad slot HTML snippets.",
  "frontend/src/lib/adsenseSnippet.ts": "Parses pasted AdSense snippets and extracts a validated ca-pub client ID.",
  "frontend/src/lib/adsOwnerSettings.ts": "Handles loading, saving, clearing, validating, and subscribing to AdSense owner settings stored in localStorage.",
  "frontend/src/lib/apkAvailability.ts": "Checks APK availability and size, and provides download helpers for customer and admin APK configs.",
  "frontend/src/lib/orderRules.ts": "Defines minimum delivery quantity rules and provides related validation and messaging helpers.",
  "frontend/src/lib/runtimeEnvironment.ts": "Detects whether the app is running in a Capacitor environment or a standard web browser.",
  "frontend/src/lib/upi.ts": "Builds UPI payment links and attempts to open Paytm, Google Pay, or generic UPI apps, with clipboard support.",
  "frontend/src/lib/vpaValidation.ts": "Validates UPI VPAs against basic format and placeholder patterns and provides an error message helper.",
  "frontend/src/lib/whatsapp.ts": "Generates WhatsApp deep links for order, payment confirmation, and screenshot requests, with open helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, plugins, colors, animations, and content paths.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-side tools, enabling strict mode and ESNext module resolution.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variable injection, path aliases, dev proxy, and build settings.",
  "project_state.json": "Tracks project metadata, requirements, known issues, and new feature requests for moving ad settings into the admin panel."
}