{
  "backend/main.mo": "Motoko canister managing orders with CRUD, payment confirmation, and status timeline tracking.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend components, hooks, utilities, and configs.",
  "frontend/android/.gitkeep": "Placeholder file ensuring the Android directory is tracked in version control.",
  "frontend/capacitor.config.ts": "Capacitor config defining app metadata, web directory, server scheme, and Android build options.",
  "frontend/index.css": "Global Tailwind base styles and dark/light theme CSS variable definitions.",
  "frontend/index.html": "Main HTML entry with PWA manifest, icons, theme metadata, and script mount point.",
  "frontend/public/ads.txt": "Ads.txt declaration for authorized Google AdSense publisher.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, and display settings.",
  "frontend/README-android-apk.md": "Instructions for building the Android APK using Capacitor and Android Studio.",
  "frontend/src/App.tsx": "Main React app handling navigation, ordering workflow, admin mode, APK logic, ads injection, and use of founder photo assets.",
  "frontend/src/components/admin/AdminApkDownloadButton.tsx": "Button that checks availability of the admin APK and triggers download or shows an unavailable alert.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin dashboard displaying order stats, filters, order list, order detail view, APK download, and logout.",
  "frontend/src/components/admin/AdminLoginModal.tsx": "Admin login modal requiring a validated 4‑digit PIN to grant dashboard access.",
  "frontend/src/components/admin/OrderDetailView.tsx": "Sheet view showing full order details with status update controls and formatted timestamps.",
  "frontend/src/components/admin/OrdersFilters.tsx": "Renders admin UI filters for orders, allowing selection of payment status and order status.",
  "frontend/src/components/admin/OrdersTable.tsx": "Displays a table of orders with formatted fields, status badges, payment info, and a view-action button.",
  "frontend/src/components/ads/AdsHeadInjector.tsx": "Injects the ad provider head script at runtime when ads are enabled; renders nothing.",
  "frontend/src/components/ads/AdSlot.tsx": "Mounts and unmounts a configured ad slot snippet into a container when ads are enabled.",
  "frontend/src/components/ads/AdsSettingsPanel.tsx": "Owner-facing panel to configure AdSense settings, validate input, and save to localStorage.",
  "frontend/src/components/OrderForm.tsx": "UI for selecting plate type and quantity, validating minimum order, and submitting createOrder via React Query.",
  "frontend/src/components/OwnerPhoto.tsx": "Renders a circular owner photo with size variants and a fallback image on load error.",
  "frontend/src/components/PostOrderConfirmationModal.tsx": "Displays a modal for post-order payment actions, UPI payment handling, WhatsApp links, and payment confirmation submission.",
  "frontend/src/components/PromoPopup.tsx": "Shows a timed promotional popup encouraging users to order, dismissible and stored per session.",
  "frontend/src/components/SimpleModal.tsx": "Provides a simple modal with content text, optional WhatsApp link actions, and copy-to-clipboard support.",
  "frontend/src/config/ads.ts": "Defines ads config structure and helpers to generate AdSense head and slot snippets.",
  "frontend/src/config/apk.ts": "Provides static configuration for customer and admin APK download details.",
  "frontend/src/config/ownerPhotos.ts": "Exports URLs for founder images at multiple sizes.",
  "frontend/src/config/payment.ts": "Defines business UPI ID, delivery charge, and business name for payments.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAdminAuthorization.ts": "Tracks admin authorization state based on URL hash and updates reactively.",
  "frontend/src/hooks/useAdminOrders.ts": "Fetches all orders for admin dashboard when authorization and actor are available.",
  "frontend/src/hooks/useAdsConfig.ts": "Computes runtime ads configuration from settings, environment, and admin mode with dynamic snippet generation.",
  "frontend/src/hooks/useCreateOrder.ts": "Provides a mutation for creating orders via the backend actor and invalidates related queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using Dfinity AuthClient, including login state and stored identities.",
  "frontend/src/hooks/useUpdateOrderStatus.ts": "React Query mutation hook that updates an order’s status via the backend actor and refreshes admin order data.",
  "frontend/src/hooks/useUpdatePaymentConfirmation.ts": "Mutation hook to submit payment confirmation details to the backend and invalidate related order queries.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, dark mode theme, base styles, and simple animation utilities.",
  "frontend/src/lib/adminAccess.ts": "Utility functions for managing admin PIN tokens via the URL hash, including validation and hash manipulation.",
  "frontend/src/lib/ads.ts": "Utilities for safely injecting ad provider scripts and mounting or unmounting ad slot snippets in the DOM.",
  "frontend/src/lib/adsenseSnippet.ts": "Parses pasted AdSense snippets to extract and validate a ca‑pub client ID.",
  "frontend/src/lib/adsOwnerSettings.ts": "Manages AdSense owner settings in localStorage with validation and change-event subscription.",
  "frontend/src/lib/apkAvailability.ts": "Checks availability and triggers downloads for customer and admin APK files based on configured URLs.",
  "frontend/src/lib/orderRules.ts": "Defines minimum order rules and provides helper messages for validating order quantity.",
  "frontend/src/lib/runtimeEnvironment.ts": "Detects whether the app is running in a Capacitor native environment or a standard web environment.",
  "frontend/src/lib/upi.ts": "Provides utilities to build UPI deep links, open various UPI apps, and copy UPI links to the clipboard.",
  "frontend/src/lib/vpaValidation.ts": "Validates UPI VPAs against basic rules and placeholder patterns and provides a generic error message.",
  "frontend/src/lib/whatsapp.ts": "Builds WhatsApp deep links for order, payment, and screenshot messages and provides helpers to open them.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, plugins, colors, animations, and content paths.",
  "project_state.json": "Tracks project metadata, requirements, and features for adding a founder photo to the site."
}