{
  "backend/main.mo": "Main backend canister implementing order creation, status updates, payment confirmation, and build status tracking with migration support.",
  "backend/migration.mo": "Migration module that upgrades old actor state to include lastBuildStatus while preserving orders and nextOrderId.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related files, components, and test requirements.",
  "frontend-file-summaries.txt": "JSON-style list of summaries describing major frontend components, utilities, and configuration files.",
  "frontend/android/.gitkeep": "Placeholder file to keep the Android platform directory in version control.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app ID, name, web output directory, and Android build options.",
  "frontend/index.css": "Global Tailwind-based CSS defining color variables, themes, and base styles for light and dark modes.",
  "frontend/index.html": "Main HTML entry point configuring meta tags, icons, PWA manifest, and loading the React app.",
  "frontend/public/ads.txt": "Ads.txt declaration for advertising authorization.",
  "frontend/public/downloads/.gitkeep": "Placeholder file preserving the downloads directory for APKs.",
  "frontend/public/downloads/README.md": "Documentation for storing, building, and deploying downloadable APK files in the public downloads folder.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, colors, icons, and display behavior.",
  "frontend/README-android-apk.md": "Guide explaining how to build an Android APK from the React app using Capacitor with prerequisites and steps.",
  "frontend/scripts/predeploy-verify.sh": "Script that runs the frontend build verification script and aborts deployment on failure.",
  "frontend/scripts/retry-build-deploy.sh": "Runs a full build and deploy sequence with logging and step-by-step execution using dfx commands.",
  "frontend/scripts/verify-build.sh": "Performs a full frontend build verification including static asset check, dependency install, type check, lint, and build.",
  "frontend/scripts/verify-static-assets.sh": "Checks that all required generated static assets exist before allowing a build or deploy.",
  "frontend/src/App.tsx": "Main React app managing navigation, modals, order flow, admin mode, and APK download handling.",
  "frontend/src/components/admin/AdminApkDownloadButton.tsx": "Button that checks availability of the admin APK and downloads it or shows an unavailable alert.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard showing stats, filters, orders, build/deploy status, owner settings, and logout controls.",
  "frontend/src/components/admin/AdminLoginModal.tsx": "Modal for entering and validating a 4‑digit admin PIN to grant dashboard access.",
  "frontend/src/components/admin/BuildDeployStatusPanel.tsx": "Panel displaying the latest build, installation, and deploy results with logs.",
  "frontend/src/components/admin/OrderDetailView.tsx": "Side panel showing detailed order information and allowing status updates.",
  "frontend/src/components/admin/OrdersFilters.tsx": "UI filters for payment status and order status on the admin orders list.",
  "frontend/src/components/admin/OrdersTable.tsx": "Table listing orders with key details, status badges, and a view-details action.",
  "frontend/src/components/admin/OwnerSettingsSection.tsx": "Section exposing owner-level settings, including AdSense configuration.",
  "frontend/src/components/ads/AdsHeadInjector.tsx": "Injects the provider's head script at runtime when ads are enabled, rendering nothing.",
  "frontend/src/components/ads/AdSlot.tsx": "Renders an ad slot container and mounts/unmounts provider snippets based on runtime ads config.",
  "frontend/src/components/ads/AdsSettingsPanel.tsx": "Admin UI for configuring AdSense settings, validating input, and saving to localStorage.",
  "frontend/src/components/OrderForm.tsx": "Order form component allowing plate selection, quantity adjustment, validation, and order submission.",
  "frontend/src/components/OwnerPhoto.tsx": "Displays a founder photo with fallback behavior and configurable sizes.",
  "frontend/src/components/PostOrderConfirmationModal.tsx": "Modal shown after an order enabling UPI payments, WhatsApp fallback links, and payment confirmation submission.",
  "frontend/src/components/PromoPopup.tsx": "Displays a timed promotional popup encouraging ordering, dismissible and session-persistent.",
  "frontend/src/components/SimpleModal.tsx": "Simple text modal with optional WhatsApp link and copy-to-clipboard support.",
  "frontend/src/config/ads.ts": "Defines ads config defaults and utilities to generate AdSense head and slot snippets.",
  "frontend/src/config/apk.ts": "Provides static APK metadata for customer and admin app downloads.",
  "frontend/src/config/contact.ts": "Stores centralized phone and location contact info.",
  "frontend/src/config/footer.ts": "Defines footer tagline, copyright text, and quick‑link navigation items.",
  "frontend/src/config/ownerPhotos.ts": "Lists public URLs for founder images with default selections.",
  "frontend/src/config/payment.ts": "Holds business UPI ID, delivery charge, and payment name constants.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useAdminAuthorization.ts": "Tracks admin authorization by monitoring URL hash and token presence.",
  "frontend/src/hooks/useAdminOrders.ts": "Fetches all orders for admin view when authorization and actor state are valid.",
  "frontend/src/hooks/useAdsConfig.ts": "Builds runtime ads config from stored settings, environment checks, and AdSense snippet generation.",
  "frontend/src/hooks/useCreateOrder.ts": "Provides a mutation to create backend orders and invalidate related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth client, login state, identity loading, and context exposure.",
  "frontend/src/hooks/useLastBuildStatus.ts": "Queries backend for the most recent build/deploy status for admin diagnostics.",
  "frontend/src/hooks/useUpdateOrderStatus.ts": "Provides a React Query mutation to update an order's status and invalidate admin order data.",
  "frontend/src/hooks/useUpdatePaymentConfirmation.ts": "Implements a mutation to submit payment confirmation details and refresh order queries.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, theme variables, dark mode values, and animation utilities.",
  "frontend/src/lib/adminAccess.ts": "Handles admin PIN validation and URL-hash–based token management for admin access control.",
  "frontend/src/lib/ads.ts": "Safely injects third-party ad provider scripts and mounts or clears ad slot snippets.",
  "frontend/src/lib/adsenseSnippet.ts": "Extracts and validates AdSense client IDs from various snippet formats.",
  "frontend/src/lib/adsOwnerSettings.ts": "Manages AdSense settings in localStorage with validation and change notifications.",
  "frontend/src/lib/apkAvailability.ts": "Checks APK availability, retrieves size, and triggers downloads for customer and admin APKs.",
  "frontend/src/lib/orderRules.ts": "Defines minimum delivery order rules and related validation messages.",
  "frontend/src/lib/runtimeEnvironment.ts": "Detects whether the app is running in Capacitor or a standard web environment.",
  "frontend/src/lib/upi.ts": "Builds UPI payment links and attempts to open Paytm, Google Pay, or generic UPI apps.",
  "frontend/src/lib/vpaValidation.ts": "Validates UPI VPAs and rejects common placeholder patterns, with a helper error message.",
  "frontend/src/lib/whatsapp.ts": "Provides helpers to build WhatsApp deep links with pre-filled order, payment, and screenshot messages, plus functions to open them in a new tab.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, plugins, and container settings.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-side tooling, enabling strict mode and ESNext modules for vite config.",
  "frontend/vite.config.ts": "Vite config setting up React plugin, env injection, aliases, dev server proxy, build options, and global definition.",
  "project_state.json": "Stores project metadata, issues, and existing features related to diagnosing and fixing deployment errors."
}