{
  "kind": "build_request",
  "title": "Show Paytm QR code on post-order confirmation (Option A)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "After an order is successfully placed, show a post-order confirmation UI (modal/confirmation screen) that includes a Paytm QR code for payment (Option A: show QR code after order is placed).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages:user"
        ],
        "quotes": [
          "Option A"
        ]
      },
      "acceptanceCriteria": [
        "When the backend order creation returns success, the app displays a confirmation modal/screen that contains a visible QR code image for Paytm payment.",
        "The QR code is not displayed before the user places an order.",
        "All user-facing text in the confirmation UI is in English."
      ]
    },
    {
      "id": "REQ-26",
      "text": "In the post-order confirmation UI, display a clear bill breakdown that includes (1) items total (from the created order total amount), (2) delivery charge (₹20), and (3) grand total (items total + delivery charge).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages:user"
        ],
        "quotes": [
          "Option A"
        ]
      },
      "acceptanceCriteria": [
        "The confirmation UI shows: Items Total, Delivery Charge (₹20), and Grand Total.",
        "Grand Total equals Items Total + 20 for the displayed values.",
        "The displayed totals use the successfully created order’s returned total amount (not a separate recomputation that could drift)."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Ensure the Paytm QR + bill breakdown appears in the same post-order confirmation modal/screen regardless of whether WhatsApp auto-open succeeds or a WhatsApp fallback link is shown due to popup blocking.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages:user"
        ],
        "quotes": [
          "Option A"
        ]
      },
      "acceptanceCriteria": [
        "If WhatsApp opens successfully, the confirmation UI still shows the Paytm QR and bill breakdown.",
        "If WhatsApp is blocked and a fallback link is shown, the confirmation UI shows the Paytm QR and bill breakdown together with the fallback link.",
        "No duplicate modals are shown; the user sees a single coherent confirmation experience."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Do not modify frontend immutable hook paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep the backend as a single Motoko actor; no additional backend services.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not implement payment verification, payment status tracking, or order state transitions based on payment.",
    "Do not integrate any external payment APIs or gateways.",
    "Do not change the existing WhatsApp deep-link ordering mechanism beyond ensuring the confirmation UI includes the QR/bill breakdown."
  ],
  "imageRequirements": {
    "required": [
      "Paytm QR code image (paytm-qr.dim_900x900.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}