{
  "kind": "build_request",
  "title": "Integrate Google AdSense monetization on customer-facing pages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a simple, safe Google AdSense integration using the existing ad system by wiring `frontend/src/config/ads.ts` with real AdSense snippets (provider head script + at least one ad slot), so ads can be displayed on the customer-facing landing page and the site can be monetized.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Adsens lgao ta ki me pese earn kar saku"
        ]
      },
      "acceptanceCriteria": [
        "`AdsHeadInjector` injects the AdSense provider script when `adsConfig.enabled === true` and `adsConfig.providerHeadSnippet` is non-empty.",
        "At least one `AdSlot` renders a non-empty ad snippet from `adsConfig.slots` on the customer landing page (not on the admin dashboard path).",
        "The AdSense provider script is injected only once per page load (no duplicate script tags)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a small in-app configuration UI (English text) to let the site owner paste their Google AdSense `ca-pub-...` client ID and ad slot IDs, and persist these settings in the browser (e.g., localStorage) without requiring backend changes; when configured, the UI should populate `providerHeadSnippet` and the configured `adsConfig.slots` at runtime.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Adsens lgao ta ki me pese earn kar saku"
        ]
      },
      "acceptanceCriteria": [
        "There is a visible, owner-accessible settings panel/page in the app (English labels) that collects: AdSense client ID and at minimum a Top Banner ad slot ID (Bottom Banner optional).",
        "Saving settings persists them locally and they are restored after refresh.",
        "After saving valid settings, ads begin rendering without a redeploy (runtime config takes effect).",
        "If no settings are provided, ads do not render and no provider script is injected."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure AdSense is not mounted in admin experiences and is disabled by default when running inside the Capacitor mobile wrapper (to avoid policy/UX issues), while remaining enabled on the standard web deployment when configured.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Adsens lgao ta ki me pese earn kar saku"
        ]
      },
      "acceptanceCriteria": [
        "No ad provider script is injected and no ad slots are mounted when the admin dashboard is shown.",
        "When running in a Capacitor environment, ads are not injected/mounted unless explicitly overridden by configuration.",
        "On normal web runs, ads can render when configuration is present."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/hooks/useInternetIdentity.ts` / `.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or any files in `frontend/src/components/ui` (compose them instead).",
    "Keep the backend as a single Motoko actor; do not introduce additional canisters/services for ad configuration storage."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers for ad management (only existing auth patterns apply).",
    "Adding backend persistence for AdSense configuration (store locally in the frontend only unless explicitly requested later).",
    "Guaranteeing AdSense account approval or earnings (depends on Google policies and traffic)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}