{
  "kind": "build_request",
  "title": "Retry build/deploy and fix the deployment failure",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Retry the full build and deployment, and identify the exact root cause of the previous deployment error by capturing and surfacing the failing command output (build logs, compile errors, and deploy/install errors).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Retry"
        ]
      },
      "acceptanceCriteria": [
        "A fresh build+deploy attempt is executed end-to-end (frontend build + backend build + canister deploy/install).",
        "The deployment failure is reproducible (if still present) with the exact failing step clearly identified and documented in logs.",
        "If the error is resolved, the deployment completes successfully and the app is reachable with both frontend and backend functioning."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure deployment is not failing due to missing static assets referenced by the frontend (especially files under /assets/generated), and add any missing required files to frontend/public/assets/generated so the frontend build and deploy succeed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Retry"
        ]
      },
      "acceptanceCriteria": [
        "The frontend build completes without missing-file errors for any referenced static assets.",
        "All referenced /assets/generated/* files used by the UI exist in frontend/public/assets/generated at deploy time."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a lightweight pre-deploy verification step that runs the existing frontend verification script and fails fast with actionable output before attempting deployment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Retry"
        ]
      },
      "acceptanceCriteria": [
        "A pre-deploy step runs frontend/scripts/verify-build.sh (or equivalent) before deployment.",
        "If typecheck/lint/build fails, deployment is aborted and the failing command output is visible and actionable."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if an upgrade requires state migration.",
    "Do not edit files in frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new product features unrelated to resolving the build/deployment failure.",
    "Introducing external databases, third-party authentication providers, or non-supported backend technologies."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}