{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Dashboard UI + Admin APK download support (hash-token gated)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a hash-token gated admin dashboard that lists all orders with payment + time/date fields and provides an order detail view (English-only).",
      "acceptanceCriteria": [
        "When opening the app with `#caffeineAdminToken=91bfa54128abedefcfe01e097af6ca29c994dd64108e32a63467963e477fde15`, an Admin Dashboard entry point is available and the order list renders.",
        "When opening the app without an admin token, admin screens/actions are not accessible and do not leak order data.",
        "Orders are shown with created date/time and payment fields (status + UTR/paid time when present) using English labels."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/adminAccess.ts",
          "operation": "create",
          "description": "Implement admin access helpers to parse/validate the admin hash token (supporting the existing `#caffeineAdminToken=...` pattern) and provide a single boolean gate used by the UI to prevent any order fetching when not authorized."
        },
        {
          "path": "frontend/src/hooks/useAdminOrders.ts",
          "operation": "create",
          "description": "Create a React Query hook that, when admin access is valid, fetches all orders from the backend actor and returns loading/error states; ensure it never fetches when admin access is invalid."
        },
        {
          "path": "frontend/src/components/admin/AdminDashboard.tsx",
          "operation": "create",
          "description": "Build the Admin Dashboard shell (English-only text) including an orders list area and an order detail area; use shadcn-ui components (e.g., Button, Input, Select, Dialog/Sheet, Table) for consistent UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/OrdersTable.tsx",
          "operation": "create",
          "description": "Render an orders table/list showing: Order ID, item name, quantity, total amount, created date/time, payment status, UTR (when present), paid date/time (when present); include a row action to open details. Use shadcn-ui Table (and related primitives) for layout. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/OrderDetailView.tsx",
          "operation": "create",
          "description": "Add an order detail view (modal/drawer or dedicated section) that displays all stored fields for the selected order with readable English labels; use shadcn-ui Dialog/Sheet components to present the detail UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the admin experience into the app: detect valid admin hash token, expose an Admin Dashboard entry point only when authorized, and conditionally render the AdminDashboard without affecting the customer experience; ensure no admin data fetch occurs unless authorized."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add admin actions for order tracking: status updates, a chronological timeline in order details, and filtering/sorting controls.",
      "acceptanceCriteria": [
        "Changing an order status in the admin UI updates the backend and the UI reflects the new status after refresh/reload.",
        "Order detail view shows a readable English timeline including created time, status-change events, and paid time when applicable.",
        "Admin can filter the list by payment status and order status, and default sorting is newest-first."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useUpdateOrderStatus.ts",
          "operation": "create",
          "description": "Create a mutation hook that calls the backend actor to update an order’s status (including a `changedBy` string from the admin UI) and refreshes cached admin order queries on success."
        },
        {
          "path": "frontend/src/components/admin/OrdersFilters.tsx",
          "operation": "create",
          "description": "Implement admin list controls for newest-first (default) sorting, filter by payment status (Paid/Unpaid), and filter by order status; use shadcn-ui Select/Input/Button components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/OrdersTable.tsx",
          "operation": "modify",
          "description": "Integrate filtering/sorting output (newest-first by default) into the displayed list and add an Order Status column that shows the current status with English labels."
        },
        {
          "path": "frontend/src/components/admin/OrderDetailView.tsx",
          "operation": "modify",
          "description": "Add an Order Status dropdown (Pending/Accepted/Preparing/Out for Delivery/Delivered/Cancelled) that triggers the update-status mutation; render a chronological English timeline including created time, each status-change event time/by, and paid time when available; use shadcn-ui Select and timeline-style layout with existing primitives. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Wire together filters, the orders list, selection state, and the order detail view; ensure status changes refresh the selected order and the list."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Support separate Admin APK configuration and add an admin-only download button with independent availability checks and clear English messaging.",
      "acceptanceCriteria": [
        "Admin dashboard includes an “Download Admin App” button that performs an availability check and downloads the admin APK when available.",
        "Customer-facing “Download App” continues to work independently of the admin APK setting.",
        "If the admin APK is missing/unavailable, the admin UI shows a clear English message rather than failing silently."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/apk.ts",
          "operation": "modify",
          "description": "Extend APK configuration to include distinct entries for the customer APK and the admin APK (separate URLs and labels), while preserving the existing customer APK defaults."
        },
        {
          "path": "frontend/src/lib/apkAvailability.ts",
          "operation": "modify",
          "description": "Update APK availability-check and download utilities to support checking/downloading a specific APK config (customer vs admin) independently, including returning the correct English unavailable message for each."
        },
        {
          "path": "frontend/src/components/admin/AdminApkDownloadButton.tsx",
          "operation": "create",
          "description": "Create an admin-only “Download Admin App” button component that uses the shared APK availability utilities to check and download the admin APK and shows a clear English message when unavailable; use shadcn-ui Button and Dialog/Alert styling as needed. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Place the admin-only download button within the Admin Dashboard and ensure it is only rendered when admin access is valid."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the existing customer “Download App” behavior continues to use the customer APK config and remains independent from the admin APK settings."
        }
      ]
    }
  ]
}