{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Google AdSense runtime configuration and safe customer-only ad rendering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Wire the existing ad system to render real Google AdSense head script and at least one ad slot on the customer landing page.",
      "acceptanceCriteria": [
        "`AdsHeadInjector` injects the AdSense provider script when `adsConfig.enabled === true` and `adsConfig.providerHeadSnippet` is non-empty.",
        "At least one `AdSlot` renders a non-empty ad snippet from `adsConfig.slots` on the customer landing page (not on the admin dashboard path).",
        "The AdSense provider script is injected only once per page load (no duplicate script tags)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/ads.ts",
          "operation": "modify",
          "description": "Update the default ad configuration to be safe-by-default (disabled with empty snippets), and add typed helpers/constants for Google AdSense snippet templates (provider head script + slot snippet builders) so runtime configuration can generate real AdSense snippets."
        },
        {
          "path": "frontend/src/hooks/useAdsConfig.ts",
          "operation": "create",
          "description": "Add a hook that produces the effective runtime `adsConfig` (including AdSense snippet generation from saved settings), exposes whether ads should be enabled, and supports reactive updates after settings are saved (e.g., via a custom window event and/or storage event)."
        },
        {
          "path": "frontend/src/components/ads/AdsHeadInjector.tsx",
          "operation": "modify",
          "description": "Refactor to use the runtime ads config (via `useAdsConfig`) instead of the static import, and inject the provider script only when enabled and the head snippet is non-empty; keep relying on `injectProviderScript` one-time marker behavior to prevent duplicates."
        },
        {
          "path": "frontend/src/components/ads/AdSlot.tsx",
          "operation": "modify",
          "description": "Refactor to use the runtime ads config (via `useAdsConfig`) so slot snippets can change at runtime; mount/unmount snippets only when enabled and the selected slot has non-empty HTML."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure at least one customer-facing placement renders an `AdSlot` (top banner already exists) and that ad components remain unmounted when the app is in the admin dashboard branch (keep early-return behavior intact)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an in-app owner settings UI to enter AdSense client and slot IDs, persist locally, and apply ads configuration at runtime without redeploy.",
      "acceptanceCriteria": [
        "There is a visible, owner-accessible settings panel/page in the app (English labels) that collects: AdSense client ID and at minimum a Top Banner ad slot ID (Bottom Banner optional).",
        "Saving settings persists them locally and they are restored after refresh.",
        "After saving valid settings, ads begin rendering without a redeploy (runtime config takes effect).",
        "If no settings are provided, ads do not render and no provider script is injected."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/adsOwnerSettings.ts",
          "operation": "create",
          "description": "Create a small local-only persistence utility for ad owner settings (load/save/clear from localStorage), including validation for required AdSense fields (client ID, top banner slot ID) and a notification mechanism (e.g., dispatch a custom event) so the app can react immediately after saving."
        },
        {
          "path": "frontend/src/components/ads/AdsSettingsPanel.tsx",
          "operation": "create",
          "description": "Implement an owner-accessible AdSense settings panel with English labels for AdSense client ID and ad slot IDs; persist to localStorage via `adsOwnerSettings` and trigger runtime refresh. Use shadcn-ui components (e.g., Dialog, Button, Input, Label) to present a small, consistent UI; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdsConfig.ts",
          "operation": "modify",
          "description": "Integrate `adsOwnerSettings` into the runtime config hook: on load, restore saved settings; when valid, generate `providerHeadSnippet` and `slots` at runtime; when missing/invalid, return ads disabled with empty snippets."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the settings UI into the customer experience (e.g., a small 'Ad Settings' link/button in an existing section such as the footer or header) and ensure it opens/closes cleanly without adding new top-level routes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Prevent ads in admin experiences and default-disable ads in Capacitor unless explicitly overridden by configuration.",
      "acceptanceCriteria": [
        "No ad provider script is injected and no ad slots are mounted when the admin dashboard is shown.",
        "When running in a Capacitor environment, ads are not injected/mounted unless explicitly overridden by configuration.",
        "On normal web runs, ads can render when configuration is present."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/runtimeEnvironment.ts",
          "operation": "create",
          "description": "Add a small environment detection helper to determine whether the app is running inside a Capacitor native wrapper (using safe feature detection) for gating ads."
        },
        {
          "path": "frontend/src/hooks/useAdsConfig.ts",
          "operation": "modify",
          "description": "Apply environment gating logic: if Capacitor is detected, default-disable ads unless the saved owner settings explicitly opt in (override flag); also ensure the hook can return ads disabled when the app is operating in an admin context."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Preserve/strengthen the existing admin guard (early return of `AdminDashboard`) so ad components never mount in admin mode; additionally ensure the owner settings entry point is not shown within the admin dashboard branch."
        },
        {
          "path": "frontend/src/components/ads/AdsSettingsPanel.tsx",
          "operation": "modify",
          "description": "Add an explicit 'Enable ads on Capacitor' override control (default off) and persist it in localStorage so the Capacitor opt-in behavior is user-controlled. Use shadcn-ui form controls where available; Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}