{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add visible hashtags section and SEO metadata",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a customer-facing “Hashtags” block that renders the provided hashtags exactly as given.",
      "acceptanceCriteria": [
        "A “Hashtags” section/block is present on the live customer website UI.",
        "All hashtags are shown exactly as the user provided (including spacing in “#veg momos”).",
        "All non-hashtag UI text added for this change is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/hashtags.ts",
          "operation": "create",
          "description": "Create a single source of truth for the provided hashtags as an ordered string list, preserving exact text (including the space in “#veg momos”)."
        },
        {
          "path": "frontend/src/components/HashtagsBlock.tsx",
          "operation": "create",
          "description": "Add a reusable HashtagsBlock component that displays an English section title (\"Hashtags\") and renders each hashtag as readable text (optionally styled as pills/chips) without modifying the hashtag strings."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new HashtagsBlock into the customer-facing UI (e.g., near the bottom of the page before the footer) so it is visible on the live website and not shown only in admin-only views."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Include the provided hashtags in HTML metadata for SEO/discoverability while keeping existing branding text intact.",
      "acceptanceCriteria": [
        "frontend/index.html includes metadata that contains all provided hashtags exactly as provided.",
        "Existing title/description content remains present (may be extended but not removed)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update HTML metadata to include all provided hashtags exactly as provided (including the space in “#veg momos”), by adding an appropriate meta tag (e.g., keywords) and/or appending to the existing meta description without removing existing title/description branding text."
        }
      ]
    }
  ]
}