{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Post-order confirmation modal with Paytm QR and bill breakdown",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Show a post-order confirmation modal/screen with a Paytm QR code image only after successful order placement.",
      "acceptanceCriteria": [
        "When the backend order creation returns success, the app displays a confirmation modal/screen that contains a visible QR code image for Paytm payment.",
        "The QR code is not displayed before the user places an order.",
        "All user-facing text in the confirmation UI is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/paytm-qr.dim_900x900.png",
          "operation": "create",
          "description": "Add the required Paytm QR static image asset at this exact path and filename so it can be rendered in the post-order confirmation UI."
        },
        {
          "path": "frontend/src/components/PostOrderConfirmationModal.tsx",
          "operation": "create",
          "description": "Create a dedicated post-order confirmation modal component that renders the Paytm QR image from frontend/public/assets/generated/paytm-qr.dim_900x900.png and displays order success messaging in English. Use the shadcn-ui Dialog (or equivalent existing modal primitives) to ensure consistent modal behavior; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new PostOrderConfirmationModal into the existing order-success flow so it opens after createOrder success and includes the Paytm QR. Ensure the QR/modal is not shown at any other time, and avoid changing the WhatsApp deep-link mechanism beyond passing necessary state into the confirmation UI."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Display a bill breakdown in the post-order confirmation UI using the created order's returned total amount plus a fixed ₹20 delivery charge.",
      "acceptanceCriteria": [
        "The confirmation UI shows: Items Total, Delivery Charge (₹20), and Grand Total.",
        "Grand Total equals Items Total + 20 for the displayed values.",
        "The displayed totals use the successfully created order’s returned total amount (not a separate recomputation that could drift)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PostOrderConfirmationModal.tsx",
          "operation": "modify",
          "description": "Add a bill breakdown section to the confirmation modal: Items Total (from order.totalAmount as returned), Delivery Charge (₹20), and Grand Total (Items Total + 20), all displayed in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Pass the created Order (including totalAmount) into PostOrderConfirmationModal so the breakdown uses the backend-returned total amount and does not rely on any separate frontend recomputation."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Ensure the same confirmation modal contains Paytm QR + bill breakdown regardless of WhatsApp auto-open success or fallback link due to popup blocking.",
      "acceptanceCriteria": [
        "If WhatsApp opens successfully, the confirmation UI still shows the Paytm QR and bill breakdown.",
        "If WhatsApp is blocked and a fallback link is shown, the confirmation UI shows the Paytm QR and bill breakdown together with the fallback link.",
        "No duplicate modals are shown; the user sees a single coherent confirmation experience."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor modal state so order-success uses a single PostOrderConfirmationModal that is always shown after success, while still attempting WhatsApp auto-open. If auto-open fails, provide the fallback WhatsApp link within the same confirmation modal (not via a second modal)."
        },
        {
          "path": "frontend/src/components/PostOrderConfirmationModal.tsx",
          "operation": "modify",
          "description": "Add optional rendering for a WhatsApp fallback link section (including copy/open actions) within the same confirmation modal when a fallback link is present, and ensure the Paytm QR + bill breakdown are always visible in the modal. Use shadcn-ui Button (or existing button styling) for actions if applicable; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/SimpleModal.tsx",
          "operation": "modify",
          "description": "Adjust existing SimpleModal usage expectations (if necessary) so it is no longer used for order-success confirmations, preventing duplicate modal experiences. Keep SimpleModal available for other non-order messages (e.g., 'App coming soon')."
        }
      ]
    }
  ]
}