{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Move Ad/Owner Settings into Admin Panel and lock behind PIN 7973",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove any customer-facing footer/navigation entry points for Ad Settings / Owner Settings (including chevron/arrow indicator) so it is not visible on the public landing page.",
      "acceptanceCriteria": [
        "On the public/customer page, the footer no longer shows “Ad Settings” (and no arrow/chevron icon related to it).",
        "There is no clickable navigation path to Ad Settings from the customer-facing UI (header, footer, mobile menu)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the public/footer “Ad Settings / Owner Settings” UI entry (including the arrow/chevron indicator) and ensure AdsSettingsPanel is not rendered anywhere in the customer-facing app tree."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an Owner Settings section inside the Admin Dashboard and render the existing AdsSettingsPanel only within the admin experience.",
      "acceptanceCriteria": [
        "When logged into admin, the Admin Dashboard displays an “Owner Settings” area.",
        "“Ad Settings” is accessible from within that “Owner Settings” area and opens the existing AdSense settings dialog/panel.",
        "AdsSettingsPanel is not rendered on the public/customer page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/OwnerSettingsSection.tsx",
          "operation": "create",
          "description": "Create an Admin Dashboard section component labeled “Owner Settings” that includes the existing AdsSettingsPanel as the way to open/manage “Ad Settings”. Use shadcn-ui primitives (e.g., Card/Button) to match the current admin UI styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Wire the new OwnerSettingsSection into the Admin Dashboard layout so it appears for authorized admin users and provides access to AdsSettingsPanel. Use existing shadcn-ui layout components to keep changes minimal. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure Owner Settings / Ad Settings access is PIN-protected by the existing admin authorization (PIN 7973), prompting for a PIN when not authorized and not re-prompting within the same authorized session.",
      "acceptanceCriteria": [
        "If a user is not admin-authorized, they cannot access Owner Settings / Ad Settings without a PIN prompt.",
        "Entering PIN 7973 unlocks access; incorrect PIN shows an English error message and keeps Owner Settings locked.",
        "If a user is already admin-authorized, Owner Settings / Ad Settings opens without requiring the PIN again in the same session/state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm the only navigation path to Owner Settings / Ad Settings is within the admin-authorized experience; ensure unauthenticated users must use the existing AdminLoginModal PIN flow (PIN 7973) before they can reach the admin UI where Owner Settings is rendered. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Ensure the Owner Settings / AdsSettingsPanel UI is only reachable when the existing admin authorization state is active (no alternate rendering paths); keep the same-session behavior by relying on the existing admin token state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminLoginModal.tsx",
          "operation": "modify",
          "description": "Reuse the existing PIN validation UX for consistency; ensure the incorrect PIN path shows an English error message and the modal remains open/locked as designed. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}